zup/ЗУП_бюджет/src/Catalogs/КадровыйРезерв/КадровыйРезерв.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КадровыйРезерв</name>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияКадровогоРезерва</types>
    </type>
  </attributes>
  <attributes>
    <name>ПозицияШтатногоРасписания</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйВозраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВозраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйСтажМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйСтажМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбразования</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПланаОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерностьПродолжительностиПланаОбучения</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрограммаОбучения</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.МероприятияОбученияРазвития</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Окончание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьКомпетенции</name>
    <attributes>
      <name>Компетенция</name>
      <type>
        <types>CatalogRef.КомпетенцииПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйУровень</name>
      <type>
        <types>CatalogRef.УровниКомпетенцийПерсонала</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Enums/НазначенияКадровогоРезерва/НазначенияКадровогоРезерва.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияКадровогоРезерва</name>
  <enumValues>
    <name>ПозицияШтатногоРасписания</name>
  </enumValues>
  <enumValues>
    <name>ГруппаКадровогоРезерва</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Catalogs/КадровыйРезерв/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Назначение = ПредопределенноеЗначение("Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания") Тогда
		Если ЗначениеЗаполнено(ПозицияШтатногоРасписания) И СуществуетКадровыйРезервНаДаннуюПозициюШР(ПозицияШтатногоРасписания) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru ='На данную позицию штатного расписания уже заведен кадровый резерв'"),
				ЭтотОбъект,
				"ПозицияШтатногоРасписания",,
				Отказ);
		КонецЕсли; 
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ПозицияШтатногоРасписания");
	КонецЕсли;
	
	ПроверитьКорректностьУстановкиТребований(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	Возврат ОбменДаннымиЗарплатаКадрыРасширенный.ОграниченияРегистрацииПоОрганизацииИПодразделению(ЭтотОбъект, , , ПозицияШтатногоРасписания);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СуществуетКадровыйРезервНаДаннуюПозициюШР(ПозицияШР)
	
	СписокПозиций = КадровыйРезерв.ПодобратьПозицииРезерваПоПозицииШтатногоРасписания(ПозицияШР, Ложь);
	
	// удаляем текущую позицию
	ИндексПозиции = СписокПозиций.Найти(Ссылка);
	Если НЕ ИндексПозиции = Неопределено Тогда
		СписокПозиций.Удалить(ИндексПозиции);
	КонецЕсли;
	
	Возврат СписокПозиций.Количество() > 0;
	
КонецФункции

Процедура ПроверитьКорректностьУстановкиТребований(Отказ)

	Если МаксимальныйВозраст > 0 И МинимальныйВозраст > МаксимальныйВозраст Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru ='Неверный диапазон возраста.'"),
			ЭтотОбъект,
			"МинимальныйВозраст",,
			Отказ);
	КонецЕсли;
	Если МаксимальныйСтажМесяцев > 0 И МинимальныйСтажМесяцев > МаксимальныйСтажМесяцев Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru ='Неверный диапазон стажа.'"),
			ЭтотОбъект,
			"МинимальныйСтажМесяцев",,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
